# WireMaterialTypeSet Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireMaterialTypeSet Class
Members See Also
---
A set that contains wire material types.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class WireMaterialTypeSet : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class WireMaterialTypeSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class WireMaterialTypeSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..WireMaterialTypeSet
# See Also
WireMaterialTypeSet Members
Autodesk.Revit.DB.Electrical Namespace